In [47]:
import pandas as pd

In [48]:
df = pd.read_csv('./Assets/students_performance.csv')
df.head(3)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93

# Manipulating Dataframes

## Selecting Columns

In [49]:
#method 1
df['gender']
#method 2
df.gender
#method many columns
df[['gender','math score']].head(3)

   gender  math score
0  female          72
1  female          69
2  female          90

## Adding columns

### Scalar Row

In [50]:
df['aproval score'] = 70
df.head(2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,aproval score
0,female,group B,bachelor's degree,standard,none,72,72,74,70
1,female,group C,some college,standard,completed,69,90,88,70

### New Column With an Array

In [51]:
import numpy as np

In [52]:
# creating array 1 to 1000 with numpy
sequential = np.arange(0,1000)
df['sequential']=sequential
df.head(2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,aproval score,sequential
0,female,group B,bachelor's degree,standard,none,72,72,74,70,0
1,female,group C,some college,standard,completed,69,90,88,70,1

In [53]:
#Thousands random number 1 to 99, 1 is inclusive, 100 exclusive
random = np.random.randint(1,100,size=1000)
df['random'] = random
df.head(2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,aproval score,sequential,random
0,female,group B,bachelor's degree,standard,none,72,72,74,70,0,83
1,female,group C,some college,standard,completed,69,90,88,70,1,58

In [55]:
#Thousands random number 1 to 99, 1 is inclusive, 100 exclusive
randomFloat = np.random.uniform(1,100,size=1000)
df['float'] = randomFloat
df.head(2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,aproval score,sequential,random,science Score,float
0,female,group B,bachelor's degree,standard,none,72,72,74,70,0,83,97,68.315656
1,female,group C,some college,standard,completed,69,90,88,70,1,58,90,50.464713